app/controllers/api/v1/books_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (16, 17, 18, 19, 20, 21, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 1)
---
  def index
    @username = current_user
    @books = (current_user.admin?) ? Book.all.includes(:user) : current_user.books

INSERT INTO `books` (`title`, `content`, `author`, `created_at`, `updated_at`, `user_id`) VALUES ('abcd', 'abcd', 'Nguyen Ngoc Ngan', '2016-08-08 08:54:09', '2016-08-08 08:54:09', 1)
---
  def create
    @book = current_user.books.new(book_params)
    id = Book.last.id+1
    if @book.imageurl != ''
      data = @book.imageurl
      path = write_file(data, id)
      @book.imageurl = LINK_CONST+path
    else
      @book.imageurl= LINK_DEFAULT_CONST
    end
    if @book.save

UPDATE `books` SET `author` = 'Abdiel Collier DDS ddd', `updated_at` = '2016-08-09 01:49:48' WHERE `books`.`id` = 16
---
  def update
    params = book_params
    id= @book.id
    if params[:imageurl] != ''
      data = params[:imageurl]
      path = write_file(data, id)
      params[:imageurl] = LINK_CONST+path
    else
      params[:imageurl] = LINK_DEFAULT_CONST
    end
    if @book.update(params)

DELETE FROM `books` WHERE `books`.`id` = 1
---
  def destroy
    @book.destroy

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 112 LIMIT 1
---
  def set_book
    @book = Book.find(params[:id])